Reports/ОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОбщиеНастройки</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦветаЭтапов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СократитьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаименованиеЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаЗнанийПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративныйАккаунт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Софт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Софт</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квалификация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОбщиеНастройки/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем мИзменения, мСписокВыбораЦвета, ТаблицаВыгрузкиИзменена;

Процедура СохранитьНаСервере(мИзменения, ТаблицаВыгрузкиИзменена)
	
	ПустойПользователь 	= Справочники.Пользователи.ПустаяСсылка();
	НомерНастройки 		= 0;
	
	Для каждого текИмя Из ПолучитьСписокИменРеквизитов() Цикл
		МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Значение 		= ЭтаФорма[текИмя];
		МенеджерЗаписи.ИмяНастройки 	= текИмя;
		МенеджерЗаписи.НомерНастройки 	= НомерНастройки;
		МенеджерЗаписи.Пользователь 	= ПустойПользователь;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Если НЕ мИзменения.Найти("ИспользоватьМножитель") = Неопределено Тогда
		Константы.ИспользоватьМножитель.Установить(ЭтаФорма.ИспользоватьМножитель);	
	КонецЕсли;

	Если НЕ мИзменения.Найти("УчитыватьПроектПриХранении") = Неопределено Тогда
		Константы.УчитыватьПроектПриХранении.Установить(ЭтаФорма.УчитыватьПроектПриХранении);	
	КонецЕсли;
	
	Если ТаблицаВыгрузкиИзменена Тогда
		СохранитьТаблицуВыгрузки();
	КонецЕсли; 
	
	СохранитьЦвета();
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры 

Процедура СохранитьЦвета()
	
	Для каждого х Из ТаблицаЦветов Цикл
		
		Если х.Изменен Тогда
		
			х.Изменен = Ложь;
			омДиаграммаГантаСерверПовтор.ЗаписатьЦветВБазу(х.НаименованиеЭтапа, х.ЭтоГруппа, х.СократитьНаименование, х.Цвет);
		
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СохранитьТаблицуВыгрузки()
	
	мНастроек = омВыгрузкаCRMНаСевере.ПолучитьНаименованиеНастроек();

	Для каждого ИмяНастройки Из мНастроек Цикл
		НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
		
		Для каждого ДанныеТаблицы Из тзВыгрузка_в_PDM Цикл
			Если ДанныеТаблицы.ИмяНастройки = ИмяНастройки И ЗначениеЗаполнено(ДанныеТаблицы.Пользователь) Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
				НоваяЗапись.НомерНастройки 	= 0;
				НоваяЗапись.Пользователь 	= ДанныеТаблицы.Пользователь;
				НоваяЗапись.Значение 		= ДанныеТаблицы.В_PDM;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьПараметрНастройкиЦвет(тзСоответствиеПрефиксКолонка, ИмяКолонки, Значение, Объект)
	НайденаяСтрока = тзСоответствиеПрефиксКолонка.Найти(ИмяКолонки, "ИмяКолонки");
	ИмяНастройки =  НайденаяСтрока.Префикс + "%" + Объект;
	
	
	НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
	
	НоваяЗапись 				= НаборЗаписей.Добавить();
	НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
	НоваяЗапись.Значение 		= Значение;
	
	НаборЗаписей.Записать();
КонецПроцедуры // ЗаписатьПараметрНастройкиЦвет()

Функция ПолучитьСписокИменРеквизитов()

	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	Возврат ОбъектОтчета.ПолучитьСписокИменРеквизитов();

КонецФункции // ПолучитьСписокИменРеквизитов()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьСписокИменРеквизитов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;
	
	
	ИспользоватьМножитель 		= Константы.ИспользоватьМножитель.Получить();
	УчитыватьПроектПриХранении = Константы.УчитыватьПроектПриХранении.Получить();
	
	ЗаполнитьТаблицуЦветов();
	ЗаполнитьВыгрузку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТаблицаВыгрузкиИзменена = Ложь;
	мИзменения 			= Новый Массив;
	мСписокВыбораЦвета 	= Новый Массив;
	
	Для каждого х Из омЦветНаСервере.ПолучитьОбъектыДляЦвета() Цикл
		мСписокВыбораЦвета.Добавить(СтрЗаменить(х.Ключ, "_", " "));	
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТаблицуЦветов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦветаЭтапов.НаименованиеЭтапа КАК НаименованиеЭтапа,
		|	ЦветаЭтапов.ЭтоГруппа КАК ЭтоГруппа,
		|	ЦветаЭтапов.СократитьНаименование КАК СократитьНаименование,
		|	ЦветаЭтапов.Цвет КАК КодЦвета
		|ИЗ
		|	РегистрСведений.ЦветаЭтапов КАК ЦветаЭтапов
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеЭтапа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НС = ТаблицаЦветов.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		
		НС.Цвет = омЦветНаСервере.ПолучитьЦветИзСтрокиСПрефиксом(Выборка.КодЦвета);
		
	КонецЦикла;
	

КонецПроцедуры // ЗаполнитьТаблицуЦветов() 

&НаКлиенте
Процедура ИспользоватьМножительПриИзменении(Элемент)
	Если мИзменения.Найти("ИспользоватьМножитель") = Неопределено Тогда
		мИзменения.Добавить("ИспользоватьМножитель");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьСделкуПриХраненииПриИзменении(Элемент)
	Если мИзменения.Найти("УчитыватьПроектПриХранении") = Неопределено Тогда
		мИзменения.Добавить("УчитыватьПроектПриХранении");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	Элементы.ПарольPDM.РежимПароля = Ложь;
КонецПроцедуры

Функция  ТестПодключенияSQLНаСервере()
	стПодключения = омMsSQL.ПолучитьСтруктуруПодключения();
	ЗаполнитьЗначенияСвойств(стПодключения, Этаформа);
	
	стОтвет = омMsSQL.СоздатьПодключениеКБД(стПодключения);
	Если ПустаяСтрока(стОтвет.Ошибка) Тогда
		Сообщить("Тест пройден");
	Иначе
		Сообщить(стОтвет.Ошибка);
	КонецЕсли;
	
КонецФункции // ТестПодключенияMySQL()

&НаКлиенте
Процедура ТестПодключенияSQL(Команда)
	 ТестПодключенияSQLНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПередУдалением(Элемент, Отказ)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	СписокУдаленныхЦветов.Добавить(ТД.Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаЦветовОбъектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	мВыбора = Новый Массив;
	
	стОтбор = Новый Структура("Объект", );
	
	Для каждого х Из мСписокВыбораЦвета Цикл
		стОтбор.Объект = х;
		Если ТаблицаЦветов.НайтиСтроки(стОтбор).Количество() = 0 Тогда
			мВыбора.Добавить(х);
		КонецЕсли;
	КонецЦикла;
	
	
	Элементы.ТаблицаЦветовОбъект.СписокВыбора.ЗагрузитьЗначения(мВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПриИзменении(Элемент)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЦветФона.ЦветФона = ТД.Цвет;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦветовЦветПриИзменении(Элемент)
	ТаблицаЦветовПриАктивизацииСтроки(Элемент);
КонецПроцедуры

 &НаКлиенте
 Процедура ВыборЦветаФонаПриИзменении(Элемент)
	 Если НЕ Элементы.ЦветФона.ЦветФона = ВыборЦветаФона Тогда
		 
		 Элементы.ЦветФона.ЦветФона = ВыборЦветаФона;
		 ТД = Элементы.ТаблицаЦветов.ТекущиеДанные;
		 
		 Если НЕ ТД = Неопределено Тогда
			 ТД.Цвет 	= ВыборЦветаФона;
			 ТД.Изменен = Истина;
		 КонецЕсли;
	 КонецЕсли;
 КонецПроцедуры
 

#Область Выгрузка 

Процедура ЗаполнитьВыгрузку()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК В_PDM,
		|	НастройкиПроекта.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НастройкиПроекта.Пользователь.Наименование,
		|	ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", омВыгрузкаCRMНаСевере.ПолучитьНаименованиеНастроек());
	
	тзВыгрузка_в_PDM.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура тзВыгрузка_в_PDMПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзВыгрузка_в_PDMПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

 &НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
    	Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = ВыбранныйЭлемент.Значение;

	СтрокиДляУдаления = Новый Массив;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если х.Пользователь = ВыбранноеЗначение Тогда
			СтрокиДляУдаления.Добавить(х);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого х Из СтрокиДляУдаления Цикл
		тзВыгрузка_в_PDM.Удалить(х);
	КонецЦикла;

	ТаблицаВыгрузкиИзменена = Истина;
	Модифицированность 		= Истина;
КонецПроцедуры
 
&НаКлиенте
Процедура СоздатьНаОснованииВыгрузка(Команда)
	стДанные = ПолучитьСтруктуруДанныхПользователя(Ложь);
	
	Если стДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", стДанные, ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаРедактированияВыгрузка(ПараметрыДанных, ДопПараметры) Экспорт

	Если НЕ ТипЗнч(ПараметрыДанных) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	стПраметры = 
	Новый Структура("ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ"
			, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь);

    стПраметры.Вставить("ПутьКФайлуEXEРаздатьПрава", Ложь);
    стПраметры.Вставить("ПутьКФайлуEXEЗабратьПрава", Ложь);
    стПраметры.Вставить("ПутьКФайлуEXEЕстьРазрегестрированные", Ложь);
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл 
				
		Если НЕ х.Пользователь = ПараметрыДанных.Пользователь Тогда
			Продолжить;
		КонецЕсли;	
		
	    Если х.ИмяНастройки = "ПутьКФайлуEXE" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXE; 
			стПраметры.ПутьКФайлуEXE = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуЗагрузки" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуЗагрузки; 
			стПраметры.ПутьКФайлуЗагрузки = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEСделки" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEСделки; 
			стПраметры.ПутьКФайлуEXEСделки = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEКонструктор" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEКонструктор; 
			стПраметры.ПутьКФайлуEXEКонструктор = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEКомпозиция" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEКомпозиция; 
			стПраметры.ПутьКФайлуEXEКомпозиция = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEГабаритныйЧерчеж" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEГабаритныйЧерчеж; 
			стПраметры.ПутьКФайлуEXEГабаритныйЧерчеж = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEИзменениеСтатусаГЧ" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEИзменениеСтатусаГЧ; 
			стПраметры.ПутьКФайлуEXEИзменениеСтатусаГЧ = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEПроекта" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEПроекта; 
			стПраметры.ПутьКФайлуEXEПроекта = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEЗагрузкаТЗ" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEЗагрузкаТЗ; 
			стПраметры.ПутьКФайлуEXEЗагрузкаТЗ = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEРаздатьПрава" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEРаздатьПрава; 
			стПраметры.ПутьКФайлуEXEРаздатьПрава = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEЕстьРазрегестрированные" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEЕстьРазрегестрированные; 
			стПраметры.ПутьКФайлуEXEЕстьРазрегестрированные = Истина;
		ИначеЕсли х.ИмяНастройки = "ПутьКФайлуEXEЗабратьПрава" Тогда
			х.В_PDM = ПараметрыДанных.ПутьКФайлуEXEЗабратьПрава; 
			стПраметры.ПутьКФайлуEXEЗабратьПрава = Истина;
		КонецЕсли;
		
	КонецЦикла;      
	
	Если НЕ стПраметры.ПутьКФайлуEXE Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXE";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXE;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуЗагрузки Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуЗагрузки";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуЗагрузки;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEПроекта Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEПроекта";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEПроекта;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEКонструктор Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEКонструктор";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEКонструктор;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEКомпозиция Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEКомпозиция";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEКомпозиция;
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEГабаритныйЧерчеж Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEГабаритныйЧерчеж";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEГабаритныйЧерчеж;
	КонецЕсли;
	
	Если НЕ стПраметры.ПутьКФайлуEXEИзменениеСтатусаГЧ Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEИзменениеСтатусаГЧ";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEИзменениеСтатусаГЧ;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEЗагрузкаТЗ Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEЗагрузкаТЗ";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEЗагрузкаТЗ;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEРаздатьПрава Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEРаздатьПрава";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEРаздатьПрава;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEЕстьРазрегестрированные Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEЕстьРазрегестрированные";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEЕстьРазрегестрированные;                
	КонецЕсли;

	Если НЕ стПраметры.ПутьКФайлуEXEЗабратьПрава Тогда
		НС = тзВыгрузка_в_PDM.Добавить();
		НС.Пользователь = ПараметрыДанных.Пользователь;
		НС.ИмяНастройки = "ПутьКФайлуEXEЗабратьПрава";
		НС.В_PDM 		= ПараметрыДанных.ПутьКФайлуEXEЗабратьПрава;                
	КонецЕсли;


	ТаблицаВыгрузкиИзменена = Истина;
	Модифицированность 		= Истина;
КонецПроцедуры // ПослеЗакрытияОкнаРедактированияВыгрузка()     

&НаКлиенте
Функция ПолучитьСтруктуруДанныхПользователя(Изменить)
	ТД = Элементы.тзВыгрузка_в_PDM.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	текПользователь = ТД.Пользователь;
	
	Если Изменить Тогда
		стДанные = Новый Структура("Пользователь, ПутьКФайлуEXEЕстьРазрегестрированные, ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ, ПутьКФайлуEXEРаздатьПрава, ПутьКФайлуEXEЗабратьПрава"
		, текПользователь);
	Иначе	
		стДанные = Новый Структура("ПутьКФайлуEXE, ПутьКФайлуEXEЕстьРазрегестрированные, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ, ПутьКФайлуEXEРаздатьПрава, ПутьКФайлуEXEЗабратьПрава");
	КонецЕсли;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если НЕ х.Пользователь = текПользователь Тогда
			Продолжить;
		КонецЕсли;
		
	    стДанные[х.ИмяНастройки] = х.В_PDM;
	КонецЦикла;
	
	Возврат стДанные;
КонецФункции // ПолучитьСтруктуруДанныхПользователя()

&НаСервереБезКонтекста
Процедура ВыгрузитьВБитриксНаСервере()
	омВыгрузкаCRMНаСевере.ВыгрузитьВБитриксРегламентноеЗадание();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВБитрикс(Команда)
	ВыгрузитьВБитриксНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(мИзменения, ТаблицаВыгрузкиИзменена);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПользователяВыгрузка(Команда)
	стДанные = ПолучитьСтруктуруДанныхПользователя(Истина);
	
	Если стДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", стДанные, ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяВыгрузка(Команда) 
	
	ОповещениеРЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияОкнаРедактированияВыгрузка", ЭтаФорма);
	ОткрытьФорму("Отчет.ОбщиеНастройки.Форма.ФормаНастройкаВыгрузкиВPDM", , ЭтаФорма, , , , ОповещениеРЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователяВыгрузка(Команда)
	СписокВыбора = Новый СписокЗначений;
	
	Для каждого х Из тзВыгрузка_в_PDM Цикл
		Если СписокВыбора.НайтиПоЗначению(х.Пользователь) = Неопределено Тогда
		     СписокВыбора.Добавить(х.Пользователь);
		 КонецЕсли;
	 КонецЦикла;
	 
	 Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект);
	 СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Укажите пользователя для удаления");

 КонецПроцедуры

#КонецОбласти
